stariron/app/controllers/favorites_controller.rb

  def index
    favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"

  def create
    favorite = Favorite.create(favorite_params)
---
INSERT INTO "favorites" ("user_id", "sign_object_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["sign_object_id", 13], ["created_at", "2020-08-19 20:33:31.570228"], ["updated_at", "2020-08-19 20:33:31.570228"]]

  def destroy
    favorite = Favorite.find(params[:id])
    favorite.destroy!
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 33]]