stariron/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "birthday" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Baby "], ["birthday", "2015-12-01"], ["updated_at", "2020-08-19 22:28:29.796856"], ["id", 1]]
---
  def update
    user = User.find(params[:id])
    user.update!(user_params)