stariron_backend/app/controllers/sign_object_controller.rb

  def index
    sign_objects = SignObject.all
---
SELECT "sign_objects".* FROM "sign_objects"

  def create
    sign_object = SignObject.create!(sign_object_params)
---
INSERT INTO "sign_objects" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-08-19 20:27:05.766202"], ["updated_at", "2020-08-19 20:27:05.766202"]]

  def show
    sign_object = SignObject.find(params[:id])
---
SELECT "sign_objects".* FROM "sign_objects" WHERE "sign_objects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]